Tekla Open API Reference for Tekla Structures 2025
AABB.MinPoint Property
 The minimum point of the axis-aligned 3d bounding box.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point MinPoint { get; set; }
Public Property MinPoint As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
AABB Class
Tekla.Structures.Geometry3d Namespace